Environment: gcp/prod/global

```

Plan: 1 to add, 0 to change, 0 to destroy.::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # local_file.backup_file will be created%0A  + resource "local_file" "backup_file" {%0A      + content              = "very nice"%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "./config.yml"%0A      + id                   = (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
```
#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Security 🛡️ `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```
</details>

#### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/4ca102da-c1b5-488f-9887-0feb06601b95/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.backup_file will be created
  + resource "local_file" "backup_file" {
      + content              = "very nice"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./config.yml"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # local_file.backup_file will be created%0A  + resource "local_file" "backup_file" {%0A      + content              = "very nice"%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "./config.yml"%0A      + id                   = (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>

*Pusher: @dawidmalina, Action: `pull_request`, Working Directory: `gcp/prod/global`, Workflow: `Terraform`*